[
	{
		"version": "Registration",
		"status": "Online",
		"duration": "27th Jan, 2025 - 12th Feb, 2025",
		"description": "Welcome to Neurathon-2025! Register now to participate in an exciting series of challenges.",
		"updates": [
			"Registration opens on 27th Jan, 2025, and closes on 12th Feb, 2025.",
			"Participants must log in through the official Neurathon-2025 website.",
			"After logging in, participants will be redirected to the dashboard to complete registration."
		]
	},
	{
		"version": "Round 1: Online Round",
		"status": "Online",
		"duration": "13th Feb, 2025 - 16th Feb, 2025",
		"description": "Participants will compete in teams of 1-4 members in an online preliminary round to qualify for the offline round.",
		"updates": [
			"Participants must form teams of 1-4 members before registration.",
			"Eligible degrees: B.Tech/B.E, M.Tech, BCA, MCA, BSc/BS, MSc/MS.",
			"Submissions must include model repositories (GitHub or equivalent), deployed links, and UML diagrams in doc format.",
			"Problem domains: NLP, CV, and Generative AI.",
			"Judging will focus on accuracy, creativity, and implementation of the solutions.",
			"The top-performing teams will advance to Round 2, held at the NIT Silchar campus."
		]
	},
	{
		"version": "Round 2: Offline Round",
		"status": "Offline",
		"duration": "21st March, 2025 - 23rd March, 2025",
		"description": "Held at NIT Silchar, this round involves problem-solving, development, and presentations, concluding with a prize distribution ceremony and speaker session.",
		"updates": [
			"<strong>Day 1 & 2</strong>: Teams will engage in a hackathon and development phase.",
			"Problem statements will be released on Day 1, and teams can choose their preferred problem.",
			"Teams must create a private GitHub repository and add the official organizing team as contributors.",
			"Regular commits will be monitored throughout the development process.",
			"All development tasks must be completed by the end of Day 2.",
			"Teams must prepare a detailed PPT showcasing their methodology, model, and results.",
			"A short working demo video can be submitted for bonus points."
		]
	},
	{
		"version": "Day 3: Presentation, Speaker Session, and Conclusion",
		"status": "Offline",
		"duration": "23rd March, 2025",
		"description": "The final day of Neurathon-2025, featuring presentations, a speaker session, and a prize distribution ceremony.",
		"updates": [
			"Teams will present their solutions before a panel of judges.",
			"Presentations will be evaluated based on creativity, technical execution, and overall impact.",
			"Attendees will participate in a speaker session on the latest trends in ML and AI.",
			"Results will be announced, followed by a prize distribution ceremony.",
			"Prizes: 1st Place - INR 10,000 + Trophy, 2nd Place - INR 7,500 + Trophy, 3rd Place - INR 5,000 + Trophy."
		]
	}
]
